app/controllers/events_controller.rb

SELECT "pastries".* FROM "pastries"
---
  def new
    #Linguini cree une patisserie fight et choisi des pastries_id
    @event = Event.new
    @pastries = Pastrie.all

INSERT INTO "events" ("date", "created_at", "updated_at", "pastrie_id") VALUES (?, ?, ?, ?)  [["date", "2019-06-10 18:06:00"], ["created_at", "2019-06-05 18:06:20.947996"], ["updated_at", "2019-06-05 18:06:20.947996"], ["pastrie_id", 0]]
---
  def create
    @event = Event.new(event_params)
    @pastrie = Pastrie.where(event_id: params[:event_id])
    @event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "pastries".* FROM "pastries" WHERE "pastries"."event_id" = ?  [["event_id", 1]]
---
  def show
    @event = Event.find(params[:id])
    # trouver les patisseries qui ont pour id, l'id enregistré lors de la selection
    @pastries = Pastrie.where(event_id: params[:event_id])