app/controllers/fights_controller.rb

SELECT "fights".* FROM "fights"
SELECT "events".* FROM "events"
---
  def index
    @fights = Fight.all
    @events = Event.all