app/controllers/fights_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "pastries".* FROM "pastries"
---
  def new
    @fight = Fight.new
    @event = Event.find(params[:event_id])
    @pastries = Pastrie.all

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "fights" ("created_at", "updated_at", "pastrie_id", "event_id") VALUES (?, ?, ?, ?)  [["created_at", "2019-06-07 19:42:49.148225"], ["updated_at", "2019-06-07 19:42:49.148225"], ["pastrie_id", 2], ["event_id", 3]]
---
  def create
    @fight = Fight.new(fight_params)
    @event = Event.find(params[:event_id])
    @fight.event = Event.find(params[:event_id])
    @fight.save

SELECT "fights".* FROM "fights" WHERE "fights"."event_id" = ?  [["event_id", 1]]
---
  def index
    @fights = Fight.where(event_id: 1)